cask_args appdir: '/Applications'

#---------------------------------------------
# Taps
#tap 'AdoptOpenJDK/openjdk'
tap 'homebrew/homebrew-cask'
tap 'homebrew/cask-fonts'
# tap 'caskroom/versions'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
# This tap is for the saml2aws formula
tap 'versent/homebrew-taps'

tap 'sass/sass'
tap 'vitorgalvao/tiny-scripts'

#---------------------------------------------
# Binaries
brew 'ansible'
brew 'autoconf'
brew 'automake'
brew 'awscli'
brew 'bash'
brew 'bat'
brew 'bcrypt'
brew 'brew-cask-completion'
brew 'brew-gem'
# Client for aws' route 53 from https://github.com/barnybug/cli53
brew 'cli53'
brew 'cmake'
brew 'coreutils'
brew 'curl'
brew 'curl-openssl'
brew 'fcrackzip'
brew 'fish'
brew 'ffind'
brew 'ffmpeg'
brew 'findutils'
brew 'gdb'
brew 'gem-completion'
brew 'git'
brew 'git-gui'
brew 'gnupg2'
brew 'graphviz'
brew 'grep'
brew 'htop'
brew 'httrack'
brew 'libgit2'
brew 'libwebm'
brew 'lua'
brew 'luarocks'
brew 'mas'
brew 'midnight-commander'
brew 'node-sass'
brew 'openssl'
brew 'pandoc'
brew 'pcre'
brew 'pdf2svg'
brew 'pyenv'
brew 'saml2aws'
# brew 'sass/sass/sass'
# To run selenium, do: `selenium-server -port 4444`
# For more options: `selenium-server -help`
# For running it automatically `brew services start selenium-server-standalone`
#brew 'selenium-server-standalone'
brew 'svg2pdf'
brew 'svn'
brew 'telnet'
brew 'tree'
#brew 'unrar'
brew 'vagrant-completion'
# for updating outdated casks with `ask-repair <outdated_cask>`
brew 'vitorgalvao/tiny-scripts/cask-repair'
# for webm see libwebm
brew 'webp'

brew 'wget'
# brew 'wpscan'
brew 'youtube-dl'
brew 'zip'

# Dev Tools and Languages
brew 'perl'

#---------------------------------------------
# Fonts from casks
# cask 'font-titillium-web'
cask 'font-aileron'
cask 'font-anton'
# cask 'font-bariol'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-pt-sans'
cask 'font-roboto'
cask 'font-source-code-pro'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-titillium'

# Google fonts
cask 'font-cabin'
cask 'font-karla'
cask 'font-oswald'
cask 'font-news-cycle'
# cask 'font-ruda'
cask 'font-poppins'
cask 'font-public-sans'

#---------------------------------------------
# applications from Casks
cask 'alfred'
cask 'adobe-acrobat-reader'
cask 'adobe-digital-editions'
cask 'arduino'
cask 'bartender'
cask 'bettertouchtool'
cask 'blackhole-16ch'
cask 'blender'
cask 'caffeine'
cask 'calibre'
cask 'camunda-modeler'
cask 'cheatsheet'
cask 'chromedriver-beta'
cask 'commander-one'
cask 'daisydisk'
cask 'dbeaver-community'
cask 'diffmerge'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'evernote'
cask 'expandrive'
cask 'firefox'
cask 'focus'
cask 'folx'
cask 'forklift'
cask 'gimp'
cask 'google-chrome' 
cask 'hammerspoon'
cask 'inkscape'
cask 'iterm2'
cask 'keyboard-maestro'
cask 'kindle'
cask 'kitematic'
cask 'krisp'
cask 'launchcontrol'
cask 'logitech-presentation'
cask 'loom'
cask 'macdown'
cask 'macpass'
#cask 'mactex'
# for some reason this cask doesn't work anymore, but I also rarely need a mouse anyway
# cask 'magicprefs'
cask 'menumeters'
# this is a "frozen" cask 
cask 'mysqlworkbench'
cask 'obs'
cask 'omnidisksweeper'
cask 'omnifocus'
cask 'omnigraffle'
# this is a "frozen" cask 
cask 'omniplan-3'
cask 'plistedit-pro'
cask 'poedit'
#cask 'pref-setter'
cask 'preference-manager'
cask 'private-internet-access'
cask 'raw-photo-processor'
cask 'rwts-pdfwriter'
cask 'reflector'
cask 'screaming-frog-seo-spider'
cask 'sequel-pro'
cask 'signal'
cask 'slack'
cask 'snagit4'
# replaced by blackhole-16ch
#cask 'soundflower'
cask 'sourcetree'
cask 'sketchup'
cask 'slic3r'
cask 'sublime-text'
cask 'sublime-merge-dev'
cask 'suspicious-package'
cask 'teamviewer'
cask 'telegram'
cask 'thebrain'
cask 'the-unarchiver'
cask 'tor-browser'
cask 'typora'
cask 'ultimaker-cura'
cask 'vlc'
cask 'veracrypt'
cask 'whatsapp'
cask 'wireshark'
cask 'xmind'
cask 'yed'
cask 'zoom'


# apps from the appstore
mas '1Password', id: 443987910
mas 'Audio Merge & Split', id: 963571828
mas 'BetterSnapTool', id: 417375580
#mas 'Camtasia 2', id: 478330793
mas 'DevSwatch', id: 1477857867
mas 'Folder Compare', id: 535348544
# mas 'Get Plain Text', id: 508368068
mas 'iMovie', id: 408981434
mas 'Infographics Lab - Templates', id: 577411683
mas 'Keynote', id: 409183694
mas 'Microsoft Remote Desktop', id: 1295203466
mas 'MuteKey', id: 1509590766
mas 'Numbers', id: 409203825
# mas 'Pym', id: 1451733095 # seemingly not longer available on the appstore :(
mas 'SiteSucker', id: 442168834
mas 'SplitPrint', id: 412574988 
mas 'Smart Json Editor', id: 1268962404
# mas 'SmugMug', id: 1115348888
# mas 'Swyx Desktop', id: 1029922555
mas 'Tadam', id: 531349534
mas 'ToothFairy', id: 1191449274
# mas 'VitaDock', id: 638118857
mas 'XCode', id: 497799835


