cask_args appdir: '/Applications'

# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Binaries
brew 'ansible'
brew 'autoconf'
brew 'automake'
brew 'awscli'
brew 'bash'
brew 'bat'
brew 'brew-cask-completion'
brew 'brew-gem'
brew 'cmake'
brew 'coreutils'
brew 'curl'
brew 'curl-openssl'
brew 'fish'
brew 'ffind'
brew 'findutils'
brew 'gdb'
brew 'gem-completion'
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'htop'
brew 'mas'
brew 'midnight-commander'
brew 'mysql@5.6'
brew 'mysql-client'
brew 'libgit2'
brew 'openssl'
brew 'pcre'
brew 'pdf2svg'
brew 'svg2pdf'
brew 'tree'
brew 'unrar'
brew 'vagrant-completion'
# for updating outdated casks with `ask-repair <outdated_cask>`
brew 'vitorgalvao/tiny-scripts/cask-repair'
brew 'wget'
brew 'youtube-dl'
brew 'zip'

# Dev Tools and Languages
brew 'perl'
brew 'php@7.2'
# brew 'python@2' # Python is already 2.7.10 installed on Mac OS X Mojave and it also comes with pip so no need to install either
#brew 'xcode' # I don't thing we'll need xcode specifically, since I only needed it for homebrew and brew only needs the tools

# Fonts from casks
cask 'caskroom/fonts/font-lato'
cask 'caskroom/fonts/font-open-sans'
cask 'caskroom/fonts/font-pt-sans'
cask 'caskroom/fonts/font-roboto'
cask 'caskroom/fonts/font-source-code-pro-for-powerline'
cask 'caskroom/fonts/font-source-code-pro'
cask 'caskroom/fonts/font-source-sans-pro'
cask 'caskroom/fonts/font-source-serif-pro'

# applications from Casks
cask 'alfred'
cask 'adobe-acrobat-reader'
cask 'adobe-creative-cloud'
cask 'bartender'
cask 'balsamiq-mockups'
cask 'bettertouchtool'
cask 'caffeine'
cask 'calibre'
cask 'camunda-modeler'
cask 'cheatsheet'
cask 'commander-one'
cask 'daisydisk'
cask 'dbschema'
cask 'diffmerge'
cask 'dropbox'
cask 'duet'
cask 'evernote'
cask 'firefox'
cask 'flickr-uploadr'
cask 'forklift'
cask 'google-chat'
cask 'google-chrome'
cask 'id3-editor'
cask 'iterm2'
cask 'caskroom/versions/java8'
cask 'keepassx'
cask 'kindle'
cask 'launchcontrol'
cask 'magicprefs'
cask 'mailbutler'
cask 'microsoft-office'
cask 'mongodb-compass-community'
cask 'mysqlworkbench'
cask 'omnidisksweeper'
cask 'omnifocus'
cask 'omnigraffle'
cask 'omniplan'
cask 'plistedit-pro'
cask 'pref-setter'
cask 'preference-manager'
cask 'phpstorm'
cask 'private-internet-access'
cask 'qbittorrent'
cask 'reflector'
cask 'robo-3t'
cask 'sequel-pro'
cask 'slack'
cask 'skype'
cask 'skype-for-business'
cask 'snagit4'
cask 'sourcetree'
cask 'sublime-text'
cask 'suspicious-package'
cask 'teamviewer'
cask 'thebrain'
cask 'the-unarchiver'
cask 'tipp10'
cask 'vagrant'
cask 'vagrant-manager'
cask 'vagrant-vmware-utility'
cask 'virtualbox-5.2'
cask 'virtualbox-extension-pack-5.2'
cask 'vlc'
cask 'whatsapp'
cask 'wireshark'
cask 'xmind'
cask 'zoomus'


# apps from the appstore
mas '1Password', id: 443987910
mas 'Audio Merge & Split', id: 963571828
mas 'BetterSnapTool', id: 417375580
mas 'Camtasia 2', id: 478330793
mas 'Folder Compare', id: 535348544
mas 'Get Plain Text', id: 508368068
mas 'Infographics Lab - Templates', id: 577411683
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'SplitPrint', id: 412574988 
mas 'Tadam', id: 531349534
mas 'ToothFairy', id: 1191449274
mas 'VitaDock', id: 638118857



