cask_args appdir: '/Applications'

#---------------------------------------------
# Taps
#tap 'AdoptOpenJDK/openjdk'
tap 'homebrew/homebrew-cask'
tap 'homebrew/cask-fonts'
# tap 'caskroom/versions'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
# This tap is for the saml2aws formula
tap 'versent/homebrew-taps'


#---------------------------------------------
# Binaries
brew 'ansible'
#brew 'apache2'
brew 'autoconf'
brew 'automake'
#brew 'awsebcli'
brew 'awscli'
brew 'bash'
brew 'bat'
brew 'brew-cask-completion'
brew 'brew-gem'
brew 'cmake'
brew 'coreutils'
brew 'curl'
brew 'curl-openssl'
brew 'fish'
brew 'ffind'
brew 'ffmpeg'
brew 'findutils'
brew 'gdb'
brew 'gem-completion'
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'htop'
brew 'httrack'
brew 'mas'
brew 'midnight-commander'
# this is a keg only version. For using this, use 
# `export PATH="/usr/local/opt/mongodb@3.0/bin:$PATH"`
# for temporary use or add
# PATH="/usr/local/opt/mongodb@3.0/bin:$PATH"
# to your ~/.bash_profile
# brew 'mongodb@3.0'	

#To have launchd start mongodb now and restart at login:
#  brew services start mongodb
#Or, if you don't want/need a background service you can just run:
#  mongod --config /usr/local/etc/mongod.conf
# brew 'mongodb'	

# this is from the tap 'mongodb/brew'

# Video player for streaming all kinds of videos
brew 'mpv'
brew 'libgit2'
brew 'openssl'
brew 'pcre'
brew 'pdf2svg'
brew 'saml2aws'

# To run selenium, do: `selenium-server -port 4444`
# For more options: `selenium-server -help`
# For running it automatically `brew services start selenium-server-standalone`
brew 'selenium-server-standalone'
brew 'svg2pdf'
brew 'tree'
brew 'unrar'
brew 'vagrant-completion'
# for updating outdated casks with `ask-repair <outdated_cask>`
brew 'vitorgalvao/tiny-scripts/cask-repair'
brew 'wget'
brew 'youtube-dl'
brew 'zip'

# Dev Tools and Languages
brew 'perl'

# brew 'python@2' # Python is already 2.7.10 installed on Mac OS X Mojave and it also comes with pip so no need to install either


#---------------------------------------------
# Fonts from casks
cask 'font-aileron'

cask 'font-anton'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-pt-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-titillium'
cask 'font-titillium-web'

# Google fonts
cask 'font-cabin'
cask 'font-karla'
cask 'font-oswald'
cask 'font-news-cycle'
cask 'font-ruda'
cask 'font-poppins'
cask 'font-public-sans'

#---------------------------------------------
# applications from Casks
cask 'alfred'
cask 'adobe-acrobat-reader'
cask 'adobe-digital-editions'
cask 'bartender'
cask 'bettertouchtool'
cask 'caffeine'
cask 'calibre'
cask 'camunda-modeler'
cask 'cheatsheet'
cask 'chromedriver-beta'
cask 'commander-one'
cask 'daisydisk'
cask 'dbeaver-community'
cask 'diffmerge'
cask 'docker'
cask 'dropbox'
#cask 'duet' -> obsolete with MacOS Catalina's sidecar
cask 'evernote'
cask 'expandrive'
cask 'firefox'
cask 'focus'
cask 'folx'
cask 'forklift'
cask 'google-chrome' 
cask 'iterm2'
cask 'keyboard-maestro'
cask 'kindle'
cask 'launchcontrol'
cask 'logitech-presentation'
cask 'loom'
cask 'magicprefs'
cask 'mailbutler'
cask 'menumeters'
# this is a "frozen" cask 
cask 'mysqlworkbench'
cask 'omnidisksweeper'
cask 'omnifocus'
cask 'omnigraffle'
cask 'omniplan'
cask 'plistedit-pro'
cask 'pref-setter'
cask 'preference-manager'
cask 'private-internet-access'
# Not supported in catalina anymore
#cask 'qbittorrent' -> went for folx (works nicely too)
cask 'reflector'
#cask 'screaming-frog-seo-spider'
cask 'sequel-pro'
# does not work anymore with Catalina :/ - we'll have to re-check after a while
# I use EasyOnTheEyes now -> via AppStore
#cask 'shades'
cask 'slack'
cask 'snagit4'
cask 'sourcetree'
cask 'sketchup'
cask 'sublime-text'
cask 'sublime-merge-dev'
cask 'suspicious-package'
cask 'teamviewer'
cask 'telegram'
cask 'thebrain'
cask 'the-unarchiver'
cask 'tipp10'
cask 'vlc'
cask 'whatsapp'
cask 'wireshark'
cask 'xmind'
cask 'yed'
cask 'zoomus'


# apps from the appstore
mas '1Password', id: 443987910
mas 'Audio Merge & Split', id: 963571828
mas 'BetterSnapTool', id: 417375580
mas 'Camtasia 2', id: 478330793

# is covered by MacOS since MacOS 10.15.1
#mas 'EasyOnTheEyes', id: 799584781
mas 'Folder Compare', id: 535348544
mas 'Get Plain Text', id: 508368068
mas 'iMovie', id: 408981434
mas 'Infographics Lab - Templates', id: 577411683
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'SplitPrint', id: 412574988 
mas 'SmugMug', id: 1115348888
mas 'Swyx Desktop', id: 1029922555
mas 'Tadam', id: 531349534
mas 'ToothFairy', id: 1191449274
mas 'VitaDock', id: 638118857
mas 'XCode', id: 497799835


