Repository: thrvr/dotfiles
Catalog: omnigraffle/stencils/UX and UI/Apple watchOS Suite.gstencil/*.strings
Languages: es, fr, ja, ko, nl, pt_br, ru, zh_hans

source: Layer 1
es: Capa 1
fr: Calque 1
ja: レイヤ 1
ko: 레이어 1
nl: Laag 1
pt_br: Tela 1
ru: Слой 1
zh_hans: 图层 1

source: Labels
es: Etiquetas
fr: Étiquettes
ja: ラベル
ko: 레이블
pt_br: Etiquetas
ru: Наклейки
zh_hans: 标签

source: Background
es: Fondo
fr: Arrière-plan
ja: 背景
ko: 백그라운드
nl: Achtergrond
pt_br: Fundo
ru: Фон
zh_hans: 背景

source: Small
es: S
fr: Petit
ja: 小さい
ko: 소형
nl: Klein
pt_br: Pequeno
ru: Малая
zh_hans: 小

source: xSmall
es: XS
fr: Très petit
ja: より小さい
pt_br: Extrapeq
ru: ОчМалая
zh_hans: 极小

source: Footnote — 12pt Regular, 14.5pt L, 0.45T
es: Leyenda 2-13 pt normal, 15,5pt E, 0,4 I
fr: Note de bas de page — 12 pt normal, interligne 14,5 pt, interlettrage 0,45
ja: 脚注 — 12pt Regular, 14.5pt L, 0.45T
ko: 각주 — 12pt 일반, 14.5pt L, 0.45T
nl: Voetnoot — 12pt Regular, 14,5pt L, 0,45T
pt_br: Nota de Rodapé — 12 pt Normal, 14,5 pt E, 0,45 J
ru: Сноска — 152 пт обычный, 14,5 пт L, 0,45 T
zh_hans: 脚注 — 12点 常规体, 14.5点 L, 0.45T

source: Caption 2 — 13pt Regular, 15.5pt L, 0.4T
es: Leyenda 1-14 pt normal, 16,5pt E, 0,4 I
fr: Légende 2 — 13 pt normal, interligne 15,5 pt, interlettrage 0,4
ja: キャプション 2 — 13pt Regular, 15.5pt L, 0.4T
ko: 캡션 2 — 13pt 일반, 15.5pt L, 0.4T
nl: Bijschrift 2 — 13pt Regular, 15,5pt L, 0,4T
pt_br: Legenda 2 — 13 pt Normal, 15,5 pt E, 0,4 J
ru: Надпись 2 — 13 пт обычный, 16,5 пт L, 0,4 T
zh_hans: 标题 2 — 13点 常规体, 15.5点 L, 0.4T

source: Caption 1 — 14pt Regular, 16.5pt L, 0.4T
es: Cuerpo-15 pt normal, 17,5 pt E, 0,05 I
fr: Légende 1 — 14 pt normal, interligne 16,5 pt, interlettrage 0,4
ja: キャプション 1 — 14pt Regular, 16.5pt L, 0.4T
ko: 캡션 1 — 14pt 일반, 16.5pt L, 0.4T
nl: Bijschrift 1 — 14pt Regular, 16,5pt L, 0,4T
pt_br: Legenda 1 — 14 pt Normal, 16,5 pt E, 0,4 J
ru: Надпись 1 — 14 пт обычный, 16,5 пт L, 0,4 T
zh_hans: 标题 1 — 14点 常规体, 16.5点 L, 0.4T

source: Body — 15pt Regular, 17.5pt L, 0.05T
es: Encabezado-15 pt seminegrita, 17,5 pt E, 0,1 I
fr: Corps — 15 pt normal, interligne 17,5 pt, interlettrage 0,05
ja: 本文 — 15pt Regular, 17.5pt L, 0.05T
ko: 본문 — 15pt 일반, 17.5pt L, 0.1T
nl: Inhoud — 15pt Regular, 17,5pt L, 0.05T
pt_br: Texto — 15 pt Normal, 17,5 pt E, 0,05 J
ru: Текст — 15 пт полужирный, 17,5 пт L, 0,05 T
zh_hans: 正文 — 15点 常规体, 17.5点 L, 0.05T

source: Headline — 15pt Semibold, 17.5pt L, 0.1T
es: Nota al pie-12 pt normal, 14,5pt E, 0,45 I
fr: Titre — 15 pt demi-gras, interligne 17,5 pt, interlettrage 0,1
ja: 見出し — 15pt Semibold, 17.5pt L, 0.1T
ko: 제목 — 15pt 세미볼드, 17.5pt L, 0.1T
nl: Koptekst — 15pt Semibold, 17,5pt L, 0,1T
pt_br: Título — 15 pt Seminegrito, 17,5 pt E, 0,1 J
ru: Заголовок — 15 пт полужирный, 17,5 пт L, 0,1 T
zh_hans: 标头 — 15点 半粗体, 17.5点 L, 0.1T

source: Paginated
es: Paginada
fr: Paginé
ja: ページ付け
ko: 페이지 지정됨
nl: Gepagineerd
pt_br: Paginadas
ru: Постраничный
zh_hans: 分页

source: Modal Sheet
es: Página modal
fr: Feuille modale
ja: モーダルシート
ko: 모달 시트
nl: Modaal blad
pt_br: Folha Modal
ru: Модальное окно
zh_hans: 模式单

source: Hierarchical
es: Jerárquica
fr: Hiérarchique
ja: 階層
ko: 계층
nl: Hiërarchisch
pt_br: Hierárquicas
ru: Иерархический
zh_hans: 分层

source: Menu Three-button layout
es: Menú Disposición de tres botones
fr: Menu Disposition en 3 boutons
ja: メニュー 3 ボタンレイアウト
ko: 메뉴 3버튼 레이아웃
nl: Menu Lay-out 3 knoppen
pt_br: Menu Layout com três botões
ru: Меню Макет с тремя кнопками
zh_hans: 菜单 三按钮布局

source: Notifications Short Look & Long Look
es: Notificaciones “Short Look” y “Long Look”
fr: Notifications Aperçu rapide et long
ja: 通知 ショートルックとロングルック
ko: 알림 짧은 모양 및 긴 모양
nl: Meldingen Korte weergave & lange weergave
pt_br: Avisos Olhada Rápida e Olhada Demorada
ru: Уведомления Короткий взгляд и длительный взгляд
zh_hans: 通知 短显示和长显示

source: App Icons
es: Iconos de Apps
fr: Icônes de l’application
ja: アプリのアイコン
ko: 앱 아이콘
nl: App-pictogrammen
pt_br: Ícones do App
ru: Значки программ
zh_hans: 应用图标

source: Companion Settings @3×
fr: Réglages associés @3×
ja: コンパニオン 設定 @3×
ko: 동반 항목 설정 @3×
nl: Partner Instellingen @3×
pt_br: Ajustes Complementares em triplo
ru: Компаньон Настройки @3×
zh_hans: 配套 设置 @3×

source: Notification Center
es: Centro de Notificaciones
fr: Centre de notification
ja: 通知 センター
ko: 알림 가운데
nl: Melding Midden
pt_br: Central de Avisos
ru: Уведомление По центру
zh_hans: 通知 中心

source: Home Screen & Long Look
es: Pantalla de inicio y “Long Look”
fr: Écran d'accueil et aperçu long
ja: ホーム画面 とロングルック
ko: 홈 화면 및 긴 모양
nl: Startscherm & lange weergave
pt_br: Tela Inicial e Olhada Demorada
ru: Главный экран и длительный взгляд
zh_hans: 主屏幕 和长显示

source: Short Look
fr: Aperçu rapide
ja: ショートルック
ko: 짧은 모양
nl: Korte weergave
pt_br: Olhada Rápida
ru: Короткий взгляд
zh_hans: 短显示

source: Table Rows With icon variants
es: Filas de tabla Con variantes de iconos
fr: Lignes de tableau Avec variantes d’icônes
ja: 表の行 さまざまなアイコン表示
ko: 표 행 아이콘 변형 포함
nl: Tabelrijen Met pictogramvarianten
pt_br: Linhas de Tabela Com variantes de ícone
ru: Строки таблицы С вариантами значков
zh_hans: 表格行 带图标变体

source: Buttons In side-by-side and full-width variants
es: Botones Variantes de anchura completa y en paralelo
fr: Boutons Variantes côte-à-côte et pleine largeur
ja: ボタン サイドバイサイド型と全幅型
ko: 버튼 병렬 및 전체 너비 변형
nl: Knoppen In varianten naast elkaar en op volledige breedte
pt_br: Botões Nas variantes lado a lado e largura completa
ru: Кнопки Расположение рядом и во всю ширину
zh_hans: 按钮 并排及全宽度变体

source: Text Styles Use these specimens to get the correct leading and tracking values
es: Estilos de texto Use estas muestras para obtener los valores correctos de espaciado e interlineado
fr: Styles de texte Utilisez ces échantillons pour obtenir les bonnes valeurs d’interligne et d’interlettrage.
ja: テキストスタイル これらの項目を使用すると、正しいリーディングとトラッキングの値を取得できます。
ko: 텍스트 스타일 이러한 표본을 사용해서 올바른 리딩 및 추적 값을 가져오십시오.
nl: Tekststijlen Gebruik deze specimens om de juiste voorloop- en volgwaarden te verkrijgen
pt_br: Estilos de Texto Use estes exemplos para obter os valores de espaços à esquerda e de espacejamento corretos
ru: Стили текста Используйте эти образцы для получения правильных начальных и контрольных значений
zh_hans: 文本样式 使用这些样本以获得正确的引导和追踪值

source: Version 1.0.1 — July 31, 2015
es: Versión 1.0.1 - 31 de Julio de 2015
fr: Version 1.0.1 — 31 juillet 2015
ja: バージョン 1.0.1 ― 2015 年 7 月 31 日
ko: 버전 1.0.1 — 2015년 7월 31일
nl: Versie 1.0.1 — 31 juli 2015
pt_br: Versão 1.0.1 — 31 de julho de 2015
ru: Версия 1.0.1, 31 июля 2015 г.
zh_hans: 版本 1.0.1 — 2015 年 7 月 31 日

source: By the Omni Group
es: De Omni Group
fr: Par The Omni Group
ja: 作成者：the Omni Group
ko: Omni Group 제공
nl: Door de Omni Group
pt_br: Da The Omni Group
ru: От The Omni Group
zh_hans: The Omni Group 制作

source: Screens and Bezels
es: Pantallas y biseles
fr: Écrans et lunettes
ja: スクリーンとベゼル
ko: 화면 및 베젤
nl: Schermen en randen
pt_br: Telas e Molduras
ru: Экраны и рамки
zh_hans: 屏幕和表圈
